src/CFD/pipe_validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       2748;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       2868;
    }
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       2988;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       3000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2880;
        startFace       3012;
    }
)

// ************************************************************************* //
